; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=11, density=0.2, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=56, seed=97

(define (problem transport-56)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l10)
    (at p2 l1)
    (at p3 l9)
    (at p4 l1)
    (at p5 l1)
    (at p6 l5)
    (at p7 l6)
    (at p8 l1)
    (at p9 l2)
    (at v1 l11)
    (at v2 l8)
    (at v3 l8)
    (at v4 l11)
    (road l4 l9)
    (road l9 l5)
    (road l8 l3)
    (road l10 l6)
    (road l10 l9)
    (road l11 l8)
    (road l2 l8)
    (road l5 l9)
    (road l8 l2)
    (road l8 l11)
    (road l9 l4)
    (road l9 l10)
    (road l10 l8)
    (road l1 l8)
    (road l6 l10)
    (road l3 l8)
    (road l8 l1)
    (road l8 l7)
    (road l8 l10)
    (road l7 l8)
    (road l1 l9)
    (road l9 l1)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l10)
    (at p3 l6)
    (at p4 l10)
    (at p5 l5)
    (at p6 l6)
    (at p7 l1)
    (at p8 l4)
    (at p9 l4))))

; plan
1. (drive v3 l8 l1)
   deleted: (at v3 l8)
   added: (at v3 l1)
   goals met: 0 of 9
2. (pick-up v3 l1 p5 c1 c2)
   deleted: (at p5 l1) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 0 of 9
3. (drive v3 l1 l9)
   deleted: (at v3 l1)
   added: (at v3 l9)
   goals met: 0 of 9
4. (pick-up v3 l9 p3 c0 c1)
   deleted: (at p3 l9) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 0 of 9
5. (drive v3 l9 l5)
   deleted: (at v3 l9)
   added: (at v3 l5)
   goals met: 0 of 9
6. (drop v3 l5 p5 c0 c1)
   deleted: (in p5 v3) (capacity v3 c0)
   added: (at p5 l5) (capacity v3 c1)
   goals met: 1 of 9
7. (pick-up v3 l5 p6 c0 c1)
   deleted: (at p6 l5) (capacity v3 c1)
   added: (in p6 v3) (capacity v3 c0)
   goals met: 1 of 9
8. (drive v3 l5 l9)
   deleted: (at v3 l5)
   added: (at v3 l9)
   goals met: 1 of 9
9. (drive v3 l9 l10)
   deleted: (at v3 l9)
   added: (at v3 l10)
   goals met: 1 of 9
10. (drive v3 l10 l6)
   deleted: (at v3 l10)
   added: (at v3 l6)
   goals met: 1 of 9
11. (drop v3 l6 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l6) (capacity v3 c1)
   goals met: 2 of 9
12. (drop v3 l6 p6 c1 c2)
   deleted: (in p6 v3) (capacity v3 c1)
   added: (at p6 l6) (capacity v3 c2)
   goals met: 3 of 9
13. (pick-up v3 l6 p7 c1 c2)
   deleted: (at p7 l6) (capacity v3 c2)
   added: (in p7 v3) (capacity v3 c1)
   goals met: 3 of 9
14. (drive v3 l6 l10)
   deleted: (at v3 l6)
   added: (at v3 l10)
   goals met: 3 of 9
15. (pick-up v3 l10 p1 c0 c1)
   deleted: (at p1 l10) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 3 of 9
16. (drive v3 l10 l8)
   deleted: (at v3 l10)
   added: (at v3 l8)
   goals met: 3 of 9
17. (drive v3 l8 l2)
   deleted: (at v3 l8)
   added: (at v3 l2)
   goals met: 3 of 9
18. (drop v3 l2 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l2) (capacity v3 c1)
   goals met: 4 of 9
19. (pick-up v3 l2 p9 c0 c1)
   deleted: (at p9 l2) (capacity v3 c1)
   added: (in p9 v3) (capacity v3 c0)
   goals met: 4 of 9
20. (drive v3 l2 l8)
   deleted: (at v3 l2)
   added: (at v3 l8)
   goals met: 4 of 9
21. (drive v3 l8 l1)
   deleted: (at v3 l8)
   added: (at v3 l1)
   goals met: 4 of 9
22. (drop v3 l1 p7 c0 c1)
   deleted: (in p7 v3) (capacity v3 c0)
   added: (at p7 l1) (capacity v3 c1)
   goals met: 5 of 9
23. (pick-up v3 l1 p8 c0 c1)
   deleted: (at p8 l1) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 5 of 9
24. (drive v3 l1 l9)
   deleted: (at v3 l1)
   added: (at v3 l9)
   goals met: 5 of 9
25. (drive v3 l9 l4)
   deleted: (at v3 l9)
   added: (at v3 l4)
   goals met: 5 of 9
26. (drop v3 l4 p8 c0 c1)
   deleted: (in p8 v3) (capacity v3 c0)
   added: (at p8 l4) (capacity v3 c1)
   goals met: 6 of 9
27. (drop v3 l4 p9 c1 c2)
   deleted: (in p9 v3) (capacity v3 c1)
   added: (at p9 l4) (capacity v3 c2)
   goals met: 7 of 9
28. (drive v2 l8 l1)
   deleted: (at v2 l8)
   added: (at v2 l1)
   goals met: 7 of 9
29. (pick-up v2 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v2 c2)
   added: (in p2 v2) (capacity v2 c1)
   goals met: 7 of 9
30. (pick-up v2 l1 p4 c0 c1)
   deleted: (at p4 l1) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 7 of 9
31. (drive v2 l1 l8)
   deleted: (at v2 l1)
   added: (at v2 l8)
   goals met: 7 of 9
32. (drive v2 l8 l10)
   deleted: (at v2 l8)
   added: (at v2 l10)
   goals met: 7 of 9
33. (drop v2 l10 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l10) (capacity v2 c1)
   goals met: 8 of 9
34. (drop v2 l10 p4 c1 c2)
   deleted: (in p4 v2) (capacity v2 c1)
   added: (at p4 l10) (capacity v2 c2)
   goals met: 9 of 9
